Public Attributes | List of all members
API_GridMeshEdge Struct Reference
Element Manager API
Describes a Grid Mesh edge. More...
#include <APIdefs_Base.h>
 Public Attributes
API_GridMeshHead  | head
General header for Grid Mesh.
API_GridElemID  | begID
The identifier of the begin vertex.
API_GridElemID  | endID
The identifier of the end vertex.
UInt32  | userData
Attached custom data.
Detailed Description
Describes a Grid Mesh edge.
Remarks
For more information see API_GridMesh.
Member Data Documentation
◆ begID
 API_GridMeshEdge::begID
The identifier of the begin vertex.
◆ endID
 API_GridMeshEdge::endID
The identifier of the end vertex.
◆ head
 API_GridMeshEdge::head
General header for Grid Mesh.
◆ userData
 API_GridMeshEdge::userData
Attached custom data.